In [85]:
#Remove the digits
import pandas as pd
a = pd.DataFrame.from_dict({'Name': ['May21', 'James', 'Adi22', 'Hello', 'Girl90'], 'Volume': [23, 12, 11, 34, 56], 'Value': [21321, 12311, 4435, 32454, 654654]})
a['Name'] = a['Name'].str.replace('\d+', '')
a

    Name   Value  Volume
0    May   21321      23
1  James   12311      12
2    Adi    4435      11
3  Hello   32454      34
4   Girl  654654      56

In [2]:
#get nth row
print(a.iloc[2])
#sort
a.sort_values(by='Volume',ascending= False)

Name       Adi
Value     4435
Volume      11
Name: 2, dtype: object

    Name   Value  Volume
4   Girl  654654      56
3  Hello   32454      34
0    May   21321      23
1  James   12311      12
2    Adi    4435      11

In [3]:
#Split Data and get selected outputs 
import pandas as pd
a = pd.DataFrame.from_dict({'Name': ['May-21', 'Jame-s', 'Adi-22', 'Hello-', '-Girl90'], 'Volume': [23, 12, 11, 34, 56], 'Value': [21321, 12311, 4435, 32454, 654654]})
a['Name']=a['Name'].str.split('-').str[0]
a[a['Name']]

KeyError: "['May' 'Jame' 'Adi' 'Hello' ''] not in index"

In [ ]:
#Filter rows by column contents
import pandas as pd
a = pd.DataFrame.from_dict({'Name': ['May-21', 'Jame-s', 'Adi-22', 'Hello-', '-Girl90'], 'Volume': [23, 12, 11, 34, 56], 'Value': [21321, 12311, 4435, 32454, 654654]})
print(a)
a[a['Name'].str.contains('am')]

In [ ]:
#Read CSV
import pandas as pd
import numpy as np
file="C:/Users/dbajracharya/Documents/Learning/Python/IntroductionToDataScienceInPython/Week3/course1_downloads/course1_downloads/world_bank.csv"
GDP=pd.read_csv(file)    
GDP

In [ ]:
#Read Excel
file="C:/Users/dbajracharya/Documents/Learning/Python/IntroductionToDataScienceInPython/Week3/course1_downloads/course1_downloads/Energy Indicators.xls"
energy = pd.read_excel(file,sheename='Energy', skiprows = 17, skip_footer = 38, usecols = range(2, 6), index_col = None, names = ["Country", "Energy Supply", "Energy Supply per Capita", "% Renewable"], na_values='...')

In [ ]:
def a():
    return 1
def b():
    return 2
def c():
    return 3
c()+b()

In [ ]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
'year': [2012, 2014, 2013, 2014],
'sale':[55, 40, 84, 31]})

In [ ]:
df

In [ ]:
df.set_index('month',inplace=True)

In [ ]:
df.index.values[2]

In [ ]:
help(pd.Series.corr)

In [ ]:
print(str(1),'adf')

In [ ]:
df

In [ ]:
train=pd.read_csv('http://bit.ly/kaggletrain')

In [ ]:
train.head()

In [ ]:
train['sn']=train.Sex.map({'female':0,'male':1})
train

In [ ]:
#loc  => rows , columns
train.loc[0:4,['Sex','sn']]

In [ ]:
train.loc[train.Age==22,'Name':'Age']#loc isquite power full ,we could select required columns and rows .

In [ ]:
train.iloc[[0,2,3],1:] # iloc is similar to loc but it uses ineger positions instead of labels,
#it is better to use iloc and loc instead of other techniques for selection,its faster and explicit.

In [ ]:
#map is used to transfer one value to another.
train['sn']=train.Sex.map({'female':0,'male':1})
train.loc[0:4,['Sex','sn']]

In [ ]:
#apply is used to apply functions to each elements
train['NameLength']=train.Name.apply(len)
train.loc[0:4,['Name','NameLength']]

In [ ]:
#Round up example
import numpy as np
train.Fare.apply(np.ceil).head()

In [ ]:
#custom functions or lambda functions could also be used in apply.
#this lambda just returns the first element of the series (x) ,is returned from the split function.
train.Name.str.split(',').apply(lambda x:x[0]).head()

In [ ]:
train.iloc[0:4,0:3].apply(max,axis=1)#axis =1 is column wise

In [ ]:
#applymap applies the function to all elements of dataframe
train.iloc[0:4,0:3].applymap(float)

In [ ]:
ContinentDict  = {'China':'Asia', 
                  'United States':'North America', 
                  'Japan':'Asia', 
                  'United Kingdom':'Europe', 
                  'Russian Federation':'Europe', 
                  'Canada':'North America', 
                  'Germany':'Europe', 
                  'India':'Asia',
                  'France':'Europe', 
                  'South Korea':'Asia', 
                  'Italy':'Europe', 
                  'Spain':'Europe', 
                  'Iran':'Asia',
                  'Australia':'Australia', 
                  'Brazil':'South America'}

In [ ]:
groups = pd.DataFrame(columns = ['size', 'sum', 'mean', 'std'])

In [ ]:
groups.iloc[0]

# **Comperhension**

In [2]:
[x for x in ['Help','No'] if x.find('e')>=0]

['Help']

# Dataframe Manually

In [26]:
import pandas as pd
import numpy as np
df = pd.DataFrame(columns=["A", "B"], data=[[115,np.nan]])
df1 = pd.DataFrame( columns=["A", "B"],  data=[[16,np.nan]])
print(df)
df=df.append(df1)
df.index=[0,1]
df

     A   B
0  115 NaN

     A   B
0  115 NaN
1   16 NaN

In [20]:
for row in df.itertuples():
    print (row.A,row.B)

5 nan
6 nan

In [28]:
df['A'].idxmin()#Get row with min A

1

In [33]:
a = pd.DataFrame.from_dict({'Name': ['May21', 'James', 'Adi22', 'Hello', 'Girl90'], 'Volume': [23, 12, 11, 34, 56], 'Value': [21321, 12311, 4435, 32454, 654654]})
b = pd.DataFrame.from_dict({'Name2': ['May21', 'James', 'Adi22', 'Hello', 'Girl90'], 'Volume2': [23, 12, 11, 34, 56], 'Value2': [21321, 12311, 4435, 32454, 654654]})

## Merge Column wise

In [78]:
pd.concat([a,b],axis=1)

     Name   Value  Volume  o   x   j   Name2  Value2  Volume2
0   May21   21321      23  9  18  36   May21   21321       23
1   James   12311      12  9  18  36   James   12311       12
2   Adi22    4435      11  9  18  36   Adi22    4435       11
3   Hello   32454      34  9  18  36   Hello   32454       34
4  Girl90  654654      56  9  18  36  Girl90  654654       56

In [84]:
a.applymap(lambda x:str(x))

     Name   Value Volume  o   x   j
0   May21   21321     23  9  18  36
1   James   12311     12  9  18  36
2   Adi22    4435     11  9  18  36
3   Hello   32454     34  9  18  36
4  Girl90  654654     56  9  18  36

In [75]:
# add  a column if not existing
col='j'
if col not in a.columns:
    a[col]=9
else:
    a[col]+=9
a

     Name   Value  Volume  o   x   j
0   May21   21321      23  9  18  36
1   James   12311      12  9  18  36
2   Adi22    4435      11  9  18  36
3   Hello   32454      34  9  18  36
4  Girl90  654654      56  9  18  36

In [71]:
for column in a:
    print(column)

Name
Value
Volume
o
x
j

In [86]:
for i in range(0,8):
    print ((i %3)+1)

1
2
3
1
2
3
1
2

In [99]:
#Remove the digits
import pandas as pd
a = pd.DataFrame.from_dict({'Name': ['May21', 'May21', 'Adi22', 'Hello', 'Girl90'], 'Volume': [23, 12, 11, 34, 56], 'Value': [21321, 12311, 4435, 32454, 654654]})
 
a.set_index('Name',inplace=True)
a.loc['May21']

       Value  Volume
Name
May21  21321      23
May21  12311      12

## Write to file

In [ ]:
with open("nonunivTownlist.txt", 'w') as f:
    for s in nonunivTownlist:
        f.write(str(s) + '\n')
        
with open("univTownlist.txt", 'w') as f:
    for s in univTownlist:
        f.write(str(s) + '\n')